---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IOnLocalLinkSharedCoordinatesSavedCallback
source: html/079cda75-6799-c253-a960-b67880b44ea5.htm
---
# IOnLocalLinkSharedCoordinatesSavedCallback Members

Revit will call this method whenever shared coordinates
 changes are saved to a linked document provided by an
 IExternalResourceServer. This call is a notification
 to the server provider that one of their Revit or DWG
 links has changed locally, and they should upload the
 new version back to their server.